Examinator/src/DataProcessors/ИмпортСотрудниковСУО/ИмпортСотрудниковСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортСотрудниковСУО</name>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уволен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияВебКабинета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьДоступаВДнях</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроведенияПрограммыОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/ИмпортСотрудниковСУО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
		
	Если ДанныеНастроек = Неопределено Тогда
		СоздаватьЭлементыСправочниковПриИхОтсутствии = Истина;			
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)

	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Обработка.ИмпортСотрудниковСУО.ТабличнаяЧасть.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузить сотрудников'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаИзФайла";
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьТаблицуИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	ЗаписатьПользователейИзТаблицы();
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка успешно завершена'"));
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтеграцию(Команда)
	ОткрытьФорму("Обработка.ИмпортСотрудниковСУО.Форма.ИнтеграцияЗарплата3");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ЗаполнитьТаблицуИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьПользователейИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных);
	
	ЕстьЗаписиСПустымИменем = (Объект.Сотрудники.НайтиСтроки(Новый Структура("ПолноеИмя", "")).Количество() > 0);
	
	Если ЕстьЗаписиСПустымИменем Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для всех записей должна быть заполнена колонка Полное имя.'"));
		Объект.Сотрудники.Очистить();
		Возврат;
	КонецЕсли;
	
	ЕстьПропущенные = (Объект.Сотрудники.НайтиСтроки(Новый Структура("Пропустить", Истина)).Количество() > 0);
	
	Если ЕстьПропущенные Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Есть записи для которых найдено более одного пользователя.
		|Они будут пропущены.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователейИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных)
	
	Объект.Сотрудники.Очистить();
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);	
	ЗагруженныеДанные.Колонки.Удалить("Идентификатор");
	ЗагруженныеДанные.Колонки.Удалить("ОписаниеОшибки");
	ЗагруженныеДанные.Колонки.Удалить("РезультатСопоставленияСтроки");
	Для каждого СтрокаТЗД Из ЗагруженныеДанные Цикл	
		НоваяСтрокаТЧ = Объект.Сотрудники.Добавить();
		Для каждого Колонка Из ЗагруженныеДанные.Колонки Цикл
			НоваяСтрокаТЧ[Колонка.Имя] = СтрокаТЗД[Колонка.Имя];
		КонецЦикла;	
		Если ЗначениеЗаполнено(СтрокаТЗД.Пользователь) Тогда
			НоваяСтрокаТЧ.НайденВБазе = Истина;
		КонецЕсли;
	КонецЦикла;
		
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователейИзТаблицы()
	
	НачатьТранзакцию();
	
	Попытка
		
		МассивГруппПользователей = Новый Массив;
		МассивГруппПользователей.Добавить(Справочники.ГруппыПользователей.ВсеПользователи);		
		
		Для каждого СтрокаТЧ Из Объект.Сотрудники Цикл
			
			Если СтрокаТЧ.Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
			// Создаем пользователя
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Пользователь) Тогда
				ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			Иначе
				ПользовательОбъект = СтрокаТЧ.Пользователь.ПолучитьОбъект();
				ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета",
					РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(, ПользовательОбъект.Ссылка));
			КонецЕсли;	
			
			ПользовательОбъект.Код = СтрокаТЧ.Код;
			ПользовательОбъект.Наименование = СтрокаТЧ.ПолноеИмя;			
			
			ОписаниеПользователяИБ = Новый Структура;
			
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ВходВПрограммуРазрешен) Тогда
				ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ВходВПрограммуРазрешен));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияСтандартная) Тогда
				ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияСтандартная));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияОС) Тогда
				ОписаниеПользователяИБ.Вставить("АутентификацияОС", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияОС));				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияOpenID) Тогда				
				ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияOpenID));
			КонецЕсли;				
						
			Если ЗначениеЗаполнено(СтрокаТЧ.Имя) Тогда
				ОписаниеПользователяИБ.Вставить("Имя", СтрокаТЧ.Имя);
			Иначе
				ОписаниеПользователяИБ.Вставить("Имя", ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(СтрокаТЧ.ПолноеИмя));
			КонецЕсли;
			
			ОписаниеПользователяИБ.Вставить("ПолноеИмя", СтрокаТЧ.ПолноеИмя);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Пароль) Тогда
				ОписаниеПользователяИБ.Вставить("Пароль", СтрокаТЧ.Пароль);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ЗапрещеноИзменятьПароль) Тогда
				ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ЗапрещеноИзменятьПароль));				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПользовательОС) Тогда
				ОписаниеПользователяИБ.Вставить("ПользовательОС", СтрокаТЧ.ПользовательОС);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПоказыватьВСпискеВыбора) Тогда
				ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ПоказыватьВСпискеВыбора));				
			КонецЕсли;
			
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияВебКабинета) Тогда
				ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияВебКабинета));				
			КонецЕсли;

			
			Если ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) ИЛИ ЗначениеЗаполнено(СтрокаТЧ.Телефон) Тогда
				
				КонтактнаяИнформацияДляЗаполнения = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация(Ложь);
				
				Если ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) Тогда
					СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
					СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
					СтрокаЗаполнения.Представление = СокрЛП(СтрокаТЧ.ЭлектроннаяПочта);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.Телефон) Тогда
					СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
					СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
					СтрокаЗаполнения.Представление = СокрЛП(СтрокаТЧ.Телефон);
				КонецЕсли;

				УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ПользовательОбъект, КонтактнаяИнформацияДляЗаполнения, Истина);
				
			КонецЕсли;		
			
			ПользовательОбъект.Записать();
			Пользователь =  ПользовательОбъект.Ссылка;
			
			// Помещаем в группу пользователей
			
			ГруппаПользователя = ПолучитьЭлементСправочника("ГруппыПользователей", СтрокаТЧ.ГруппаПользователей,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(ГруппаПользователя) Тогда
			
				ГруппаПользователяОбъект = ГруппаПользователя.ПолучитьОбъект();			
				Если ГруппаПользователяОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					СтрокаСостава = ГруппаПользователяОбъект.Состав.Добавить();
					СтрокаСостава.Пользователь = Пользователь;
				КонецЕсли;
				ГруппаПользователяОбъект.Записать();
				
				Если МассивГруппПользователей.Найти(ГруппаПользователя) = Неопределено Тогда
					МассивГруппПользователей.Добавить(ГруппаПользователя);
				КонецЕсли;
				
			КонецЕсли;
				
			// Помещаем в учебную группу
			
			УчебнаяГруппа = ПолучитьЭлементСправочника("УчебныеГруппыСУО", СтрокаТЧ.УчебнаяГруппа,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
				
				УчебнаяГруппаОбъект = УчебнаяГруппа.ПолучитьОбъект();
				
				Если УчебнаяГруппаОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда						
					СтрокаСостава = УчебнаяГруппаОбъект.Состав.Добавить();
					СтрокаСостава.Пользователь = Пользователь;						
				КонецЕсли;		
					
				УчебнаяГруппаОбъект.Записать();
				
			КонецЕсли;
			
			// Помещаем в группу доступа
					
			ГруппаДоступа = ПолучитьЭлементСправочника("ГруппыДоступа", СтрокаТЧ.ГруппаДоступа,,Ложь);
			
			Если ЗначениеЗаполнено(ГруппаДоступа) Тогда
				
				ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
				
				Если ГруппаДоступаОбъект.Пользователи.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				ГруппаДоступаОбъект.Записать();
				
			КонецЕсли;

			// Создаем сотрудника
			
			Организация = ПолучитьЭлементСправочника("Организации", СтрокаТЧ.Организация,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			ПодразделениеОрганизации = ПолучитьЭлементСправочника("ПодразделенияОрганизацииСУО", СтрокаТЧ.ПодразделениеОрганизации, Организация, СоздаватьЭлементыСправочниковПриИхОтсутствии);
			ПодразделениеПредприятия = ПолучитьЭлементСправочника("ПодразделенияПредприятияСУО", СтрокаТЧ.ПодразделениеПредприятия,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Должность = ПолучитьЭлементСправочника("ДолжностиСУО", СтрокаТЧ.Должность,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Уволен = ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.Уволен);
			ТабельныйНомер = СтрокаТЧ.ТабельныйНомер;
			
			Если ЗначениеЗаполнено(Организация)
				ИЛИ ЗначениеЗаполнено(ПодразделениеОрганизации)
				ИЛИ ЗначениеЗаполнено(ПодразделениеПредприятия)
				ИЛИ ЗначениеЗаполнено(Должность) Тогда
			
				СвойстваЗаписиСотрудника = НайтиЗаписьОСотруднике(
					Пользователь, Организация, ПодразделениеОрганизации, ПодразделениеПредприятия, Должность, Уволен, ТабельныйНомер);			
				
				Если СвойстваЗаписиСотрудника = Неопределено Тогда
					ЗаписьРегистра = РегистрыСведений.СотрудникиСУО.СоздатьМенеджерЗаписи();
					ЗаписьРегистра.Период = ТекущаяДатаСеанса();
					ЗаписьРегистра.Пользователь = Пользователь;
					ЗаписьРегистра.Организация = Организация;
					ЗаписьРегистра.ТабельныйНомер = ТабельныйНомер;
					ЗаписьРегистра.ПодразделениеОрганизации = ПодразделениеОрганизации;
					ЗаписьРегистра.ПодразделениеПредприятия = ПодразделениеПредприятия;
					ЗаписьРегистра.Должность = Должность;
					ЗаписьРегистра.Уволен = Уволен;
					ЗаписьРегистра.Записать();
				КонецЕсли;			
				
			КонецЕсли;
			
			// Устанавливаем время доступа
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПродолжительностьДоступаВДнях)
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаТЧ.ПродолжительностьДоступаВДнях) Тогда
				
				Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО") Тогда
					ВызватьИсключение НСтр("ru = 'Для установки ограничения времени доступа включите флажок «Использовать ограничения доступа к программе» в форме «Настройки обучения» раздела Администрирование'")
				КонецЕсли;
				
				ОграничениеПоВремениЧисло = Число(СтрокаТЧ.ПродолжительностьДоступаВДнях); // В днях
				
				Если ОграничениеПоВремениЧисло > 0 Тогда
					
					ДатаНачалаДоступа = ТекущаяДатаСеанса();
					ДатаОкончанияДоступа = ДатаНачалаДоступа + ОграничениеПоВремениЧисло*24*60*60;
					
					РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(Пользователь, ДатаНачалаДоступа, ДатаОкончанияДоступа);
					
				КонецЕсли;			
				
			КонецЕсли;
			
			// Назначаем на проведение обучения
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерПроведенияПрограммыОбучения) Тогда
				
				ПроведениеПрограммыОбучения	= ПолучитьДокументПоНомеру("ПроведениеПрограммыОбученияСУО", СтрокаТЧ.НомерПроведенияПрограммыОбучения);
				УправлениеОбучениемСУО.ЗачислитьУчастникаНаПрограммуОбучения(ПроведениеПрограммыОбучения, Пользователь);				
				
			КонецЕсли;
						
			// Добавляем новость
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерНовости) Тогда
				
				Новость	= ПолучитьДокументПоНомеру("НовостьСУО", СтрокаТЧ.НомерНовости);
				
				НовостьОбъект = Новость.ПолучитьОбъект();
						
				Если НовостьОбъект.Получатели.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					НовостьОбъект.Получатели.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				Если НовостьОбъект.Проведен Тогда
					НовостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					НовостьОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
			// Добавляем организатору
			
			Организатор = ПолучитьЭлементСправочника("ОрганизаторыСУО", СтрокаТЧ.Организатор,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(Организатор) Тогда
				
				ОрганизаторОбъект = Организатор.ПолучитьОбъект();
						
				Если ОрганизаторОбъект.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					ОрганизаторОбъект.Видимость.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				ОрганизаторОбъект.Записать();				
			
			КонецЕсли;

			
		КонецЦикла;		
		
		// Обновляем группы пользователей
		Для каждого ГруппаДляДобавления Из МассивГруппПользователей Цикл
			ПользователиСлужебный.ОбновитьСоставыГруппПользователей(ГруппаДляДобавления);
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Объект.Сотрудники.Очистить();
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементСправочника(Знач ИмяСправочника, Знач СтроковоеЗначение, Знач Владелец = Неопределено, Знач СоздаватьЭлементСправочника = Ложь)
	
	Если НЕ ЗначениеЗаполнено(СтроковоеЗначение) Тогда
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли;
	
	ЗначениеСправочника = Справочники[ИмяСправочника].НайтиПоНаименованию(СтроковоеЗначение, Истина,,Владелец);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСправочника) Тогда
		Если СоздаватьЭлементСправочника Тогда
			НовыйЭлементСправочникаОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			НовыйЭлементСправочникаОбъект.Наименование = СтроковоеЗначение;
			Если Владелец <> Неопределено Тогда
				НовыйЭлементСправочникаОбъект.Владелец = Владелец;
			КонецЕсли;
			Для каждого РеквизитСправочника Из Метаданные.Справочники[ИмяСправочника].Реквизиты Цикл
				ТипыРеквизита = РеквизитСправочника.Тип.Типы();
				ЕдинственныйТип = ?(ТипыРеквизита.Количество() = 1, ТипыРеквизита[0], Тип("Неопределено"));
				Если РеквизитСправочника.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку
					И ОбщегоНазначения.ЭтоСсылка(ЕдинственныйТип) 
					И ОбщегоНазначения.ВидОбъектаПоТипу(ЕдинственныйТип) = "Справочник" Тогда
					СтроковоеПредставлениеТипа = ОбщегоНазначения.СтроковоеПредставлениеТипа(ЕдинственныйТип);
					СтроковоеПредставлениеТипаИмяСправочника = СтрРазделить(СтроковоеПредставлениеТипа, ".", Ложь)[1];										
					ВложенныйЭлемент = ПолучитьЭлементСправочника(СтроковоеПредставлениеТипаИмяСправочника, СтроковоеЗначение, Неопределено, Ложь); // Рекурсия
					НовыйЭлементСправочникаОбъект[РеквизитСправочника.Имя] = ВложенныйЭлемент; 
				КонецЕсли;			
			КонецЦикла;
			НовыйЭлементСправочникаОбъект.ПроверитьЗаполнение();
		    НовыйЭлементСправочникаОбъект.Записать();
			ЗначениеСправочника = НовыйЭлементСправочникаОбъект.Ссылка;
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Элемент ""%1"" справочника %2 не найден'"), СтроковоеЗначение, ИмяСправочника);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеСправочника;
	
КонецФункции

&НаСервере
Функция ПолучитьДокументПоНомеру(Знач ИмяДокумента, Знач НомерДокумента)
	
	Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
		Возврат Документы[ИмяДокумента].ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаДокумент = Документы[ИмяДокумента].НайтиПоНомеру(НомерДокумента);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ ""%1"" по номеру %2 не найден'"), ИмяДокумента, НомерДокумента);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Возврат СсылкаНаДокумент;
		
КонецФункции

&НаСервере
Функция НайтиЗаписьОСотруднике(Пользователь, Организация, ПодразделениеОрганизации, ПодразделениеПредприятия, Должность, Уволен, ТабельныйНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУО.Период КАК Период,
		|	СотрудникиСУО.Пользователь КАК Пользователь,
		|	СотрудникиСУО.Организация КАК Организация,
		|	СотрудникиСУО.ТабельныйНомер КАК ТабельныйНомер
		|ИЗ
		|	РегистрСведений.СотрудникиСУО КАК СотрудникиСУО
		|ГДЕ
		|	СотрудникиСУО.Пользователь = &Пользователь
		|	И СотрудникиСУО.Организация = &Организация
		|	И СотрудникиСУО.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|	И СотрудникиСУО.ПодразделениеПредприятия = &ПодразделениеПредприятия
		|	И СотрудникиСУО.Должность = &Должность
		|	И СотрудникиСУО.Уволен = &Уволен
		|	И СотрудникиСУО.ТабельныйНомер = &ТабельныйНомер";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ПодразделениеПредприятия", ПодразделениеПредприятия);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Уволен", Уволен);
	Запрос.УстановитьПараметр("ТабельныйНомер", ТабельныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
		Возврат Новый Структура("Пользователь, Период, Организация, ТабельныйНомер",
			ВыборкаДетальныеЗаписи.Пользователь, ВыборкаДетальныеЗаписи.Период, ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.ТабельныйНомер);
			
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()	
	Элементы.ФормаЗагрузитьИзТаблицы.Доступность = (Объект.Сотрудники.Количество() > 0);	
КонецПроцедуры

#КонецОбласти
